абрикос=apricot
абонент=subscriber
абитуриент=enrollee
абзац=paragraph
абсолютно=absolutely
абажур=shade
ажитация=agitation
ажур=openwork
азарт=excitement
азартно=recklessly
азбука=alphabet
азот=nitrogen
азотистый=nitrous
аист=stork
айсберг=iceberg
академик=academician
академический=academic
академия=academy
акация=acacia
акваланг=aqualung
аквалангист=aqualunger
аквамарин=aquamarine
аквамариновый=aquamarine
аквапарк=aquapark
акваплан=aquaplane
акварель=watercolor
акварельный=watercolor
аквариум=aquarium
акватория=waterarea
акведук=aqueduct
аккорд=accord
аккордеон=accordion
аккордеонист=accordionist
аккумулятор, батарея=battery
аккуратно=carefully
аккуратность=accuracy
аккуратный=careful
акрил=acrylic
акриловый=acrylic
акробат=acrobat
акробатика=acrobatics
акробатический=acrobatic
аксессуар=accessory
акт=act
актер=actor
актерский=actorish
актерство=acting
актив=assets
активатор=activator
активация=activation
активировать=activate
активист=activist
активно=energetically
активность=activity
актриса=actress
актуально=topically
актуальность=topicality
актуальный=actual
акула=shark
акустический=acoustic
акушер=obstetrician
акушерка=midwife
акушерский=obstetric, obstetrical
акушерство=obstetrics
акцент=accent
акцентировать=emphasize
акция=action
алгебра=algebra
алгебраический=algebraic
алгоритм=algorithm
алгоритмический=algorithmic
алебастр=alabaster
алебастровый=alabastrine
алкаш=boozer
алкоголизм=alcoholism
алкоголик=alcoholic
алкоголичка=alcoholic
алкоголь=alcohol
аллегорический=allegorical
аллегория=allegory
аллея=alley
аллилуйя=hallelujah
аллитерация=alliteration
алло=hulloa
алмаз=diamond
алмазный=diamond
алоэ=aloe
алтарь=altar
алфавит=alphabet
алфавитный=alphabetical
алхимик=alchemist
алхимический=alchemical
алхимия=alchemy
алчно=avidly
алчность=greed
алчный=greedy
алый=scarlet
алыча=alycha
альбом=album
альпинизм=mountaineering
альпинист=climber
альтернатива=alternative
альтернативный=alternative
альфонс=gigolo
алюминиевый=aluminum
алюминий=aluminum
амазонка=Amazon
амазонский=Amazonian
амбар=barn
амбициозность=ambition
амбиция=ambition
амеба=amoeba
аметист=amethyst
аминь=amen
амнезия=amnesia
аморфизм=amorphism
аморфный=amorphous
амплитуда=amplitude
амулет=amulet
амфибия=amphibian
амфора=amphora
анаконда=anaconda
аналептический=analeptic
анализ=analysis
анализатор=analyzer
анализирование=assaying
анализировать=analyze
аналитик=analyst
аналитический=analytical
аналог=analogue
аналогический=analogical
аналогичный=analogous
аналогия=analogy
ананас=pineapple
анархичный=anarchist
анархия=anarchy
анатомический=anatomical
анатомия=anatomy
ангар=hangar
ангел=angel
ангина=angina
английский=English
англичанин=Englishman
англичанка=Englishwoman
анекдот=joke
анестезиолог=anesthetist
анестезировать=anesthetize
анестезист=anesthetist
анестезия=anesthesia
анимационный=animated
анимация=animation
анкета=questionnaire
анкетирование=questionnaire
аннотация=annotation
ансамбль=ensemble
антивирус=virus
антидепрессант=antidepressant
античность=antiquity
античный=antique
антоним=antonym
антонимичный=antonymous
антракт=intermission
антураж=entourage
анчоус=anchovy
аншлаг=full house
апартамент=apartment
апатично=torpidly
апатичность=lethargy
апатичный=apathetic
апатия=apathy
апельсин=orange
аплодировать=applaud
аплодисменты=applause
апология=apology
апостроф=apostrophe
аппарат=machine
аппетит=appetite, stomach
аппетитный=appetizing
апрель=April
аптека=pharmacy
аптекарь=apothecary
аптечка=medicine chest
арбалет=crossbow
арбуз=watermelon
аргумент=argument
аргументация=argumentation
аренда=lease
арендатор=tenant
арендный=rent
арендовать=lease
арест=arrest
арестант=prisoner
арестованный=arrested
аристократ=aristocrat
аристократизм=aristocracy
аристократический=aristocratic
аритмичный=unrhythmical
аритмия=arrhythmia
арифметик=arithmetician
арифметический=arithmetic
арматура=fittings
армия=army
аромат=flavor
арсенал=arsenal
артист=artist
артистический=artistic
артистичность=artistry
арфа=harp
арфист=harper
археолог=archaeologist
археологический=archaeological
археология=archaeology
архив=archives
асимметричный=asymmetric
асимметрия=asymmetry
асимптота=asymptote
асинхронный=asynchronous
аспирант=graduate student
аспирин=aspirin
ассимиляционный=anabolic
ассимиляция=assimilation
ассистент=assistant
ассортимент=assortment
астероид=asteroid
астронавт=astronaut
астронавтика=astronautics
астрономический=astronomical
астрономия=astronomy
асфальт=asphalt
атаковать=attack
атаман=chieftain
атеист=atheist
ателье=studio
атлас=atlas
атлет=athlete
атлетика=athletics
атмосфера=atmosphere
атмосферический=atmospheric
атрибут=attribute
атрофированный=atrophied
атрофироваться=atrophy
аттестация=validation
аттестовать=attest
аттракцион=attraction
аудиенция=audience
аудиосистема=audio system
аудитор=auditor
аудитория=audience
аукцион=auction
аукционист=auctioneer
афера=fraud
аферист=gambler
афиша=poster
афишировать=advertise
аффект=affect
аффектация=affectation
аэробика=aerobics
аэробус=airbus
аэровокзал=air terminal
аэродинамика=aerodynamics
аэродинамический=aerodynamic
аэродром=aerodrome
аэрозоль=aerosol
аэроплан=airplane
аэропорт=airport
аэропочта=airmail
авангард=vanguard
аванс=advance
авантюрист=adventurer
аварийный=emergency
авария=accident
авеню=avenue
авиабаза=air base
авиабилет=airfare
авиакатастрофа=plane crash
авиалиния=airline
авианосец=aircraft carrier
авокадо=avocado
автобаза=motor depot
автобус=bus
автовокзал=bus station
автогонки=car race
автограф=autograph
автография=autography
автодорога=highway
автодорожный=road transport
автодром=autodrome
автомобилист=motorist
автомобиль=car
автомобильный=automotive
автор=author
авторский=authorial
авторство=authorship
автослесарь=car mechanician
автоспорт=motor racing
автостоянка=parking
автострада=motorway
автострахование=car insurance
автоцентр=car center
агент=agent
агентский=agential
агентство=agency
агитация=agitation
агитировать=agitate
агония=agony
аграрный=agrarian
агрегат=unit
агрессивность=aggressiveness
агрессивный=aggressive
агрессия=aggression
агрессор=aggressor
агроном=agronomist
агрономический=agronomic
агрономия=agronomy
агрофирма=agricultural company
агрохимия=agrochemistry
адаптация=adaptation
адаптер=adapter
адаптивный=adaptive
адаптированный=adapted
адаптировать=adapt
адвокат=lawyer
адвокатский=advocatory
адвокатура=advocacy
аддитивность=additivity
адекватность=adequacy
адекватный=adequate
административный=administrative
администратор=administrator
администрация=administration
адмирал=admiral
адрес=address
адресант=addresser

бабочка=butterfly
бабуля=granny
бабушка=grandmother
багаж=buggage
багажник=trunk
багет=baguette
багрянец=purple
бадминтон=badminton
базальт=basalt
базальтовый=basaltic
базар=market
базилик=basil
базировать=base
базироваться=be based
базис=basis
базисный=basic
байдарка=kayak
байдарочный=canoeing
байка=baize
байкер=biker
байт=byte
бакалавр=bachelor
баклажан=eggplant
баклан=gannet
бактериальный=bacterial
бактерия=bacterium
балаган=farce
балаганный=farcical
балалайка=balalaika
баланда=skilly
баланс=balance
балансер=balancer
балбес=bonehead
балда=noodle
балет=ballet
балка=beam
балкон=balcony
балл=point
баллада=ballad
балласт=ballast
баллон=balloon
баллончик=can
баллотировать=ballot
баловать=indulge
баловаться=piddle
бамбук=bamboo
бампер=bumper
банальность=commonplace
банальный=banal
банан=banana
банда=gang
бандероль=wrapper
бандит=bandit
бандитизм=banditry
бандура=pandora
банк=bank
банкет=banquet
банкир=banker
банкирский=banking
банкнот=bill
баннер=banner
банька=bathhouse
баня=bath
баобаб=baobab
бар=bar
барабан=drum
барабанщик=drummer
барабулька=surmullet
баран=ram
баратея=barathea
барахолка=flea market
барахольщик=magpie
барбекю=barbecue
бардак=mess
барельеф=low relief
баржа=barge
баркан=lasso
бармен=bartender
барокко=baroque
барометр=barometer
барсук=badger
бархат=velvet
барыня=lady
барьер=barrier
баскетбол=basketball
баскетболист=basketball player
басня=fable
бассейн=swimming pool
бастовать=strike
бастующий=striker
батальон=battalion
батарейка=battery
батик=batic
батискаф=bathyscaphe
батист=cambric
батометр=bathometer
батон=long loaf
батончик=stick of confectionery
батут=trampoline
бахилы=shoe covers
бацилла=bacillus
бациллярный=bacillary
бачок=tank
башенка=turret
башмак=shoe
башмачник=shoemaker
башня=tower
баян=accordion
баянист=accordionist
бдение=vigil
бдительность=vigilance
бдительный=vigilant
беганье=running
бегать=run
бегемот=hippopotamus
беглец=fugitive
бегство=escape
бегун=runner
бедно=humbly
бедность=poverty
беднота=poor
бедокур=mischief
бедолага=pilgarlic
бедствие=disaster
бедствовать=live in poverty
безветрие=calm
безвинный=innocent
безвкусие=insipidity
безвкусица=raunch
безвкусно=flashily
безграничность=infinity
безделица=trifle
безделка=gaud
безделушка=bauble
бездна=abyss
бездомность=homelessness
бездомный=homeless
безжалостный=ruthless
беззаботность=carelessness
беззаботный=carefree
безликий=faceless
безликость=impersonality
безмолвие=silence
безмолвно=mutely
безнадежно=hopelessly
безнадежность=hopelessness
безнадежный=hopeless
безобидность=innocuity
безобидный=harmless
безобразно=disgustingly
безобразный=ugly
безопасно=safely
безопасность=security
безопасный=safe
безответственно=irresponsibly
безответственность=irresponsibility
безответственный=irresponsible
безошибочно=accurately
безошибочность=accurateness
безошибочный=unmistakable
безразличие=indifference
безразлично=indifferently
безразличный=indifferent
безумно=madly
безумный=mad
безумство=madness
безупречно=faultlessly
безупречность=perfection
безупречный=irreproachable
безусловно=certainly
безусловность=absoluteness
безусловный=unconditional
бейсбол=baseball
бейсболист=ballplayer
бейсболка=baseball cap
бекон=bacon
беление=whitening
беленький=white
белиберда=rubbish
белка=squirrel
белье=linen
бельмо=albugo
бенефис=benefit
бензин=petrol
бензол=benzene
бензопила=gasoline saw
бергамот=bergamot
бережно=carefully
бережный=careful
береза=birch
беременеть=become pregnant
беременная=pregnant
беременность=pregnancy
беречь=protect
беречься=beware
берлога=lair
беседа=conversation
беседовать=talk
бесить=enrage
беситься=rage
бесконечно=infinitely
беспокоиться=worry
беспокойно=discomposedly
беспокойный=restless
беспокойство=concern
бесполезно=needlessly
бесполезность=uselessness
бесполезный=useless
беспомощно=blankly
беспомощность=impotence
беспомощный=helpless
беспощадно=hip and thigh
беспощадность=mercilessness
беспощадный=merciless
беспредел=total lawlessness
беспредельный=boundless
беспрерывность=continuity
беспрестанный=continual
бессердечность=callousness
бессердечный=heartless
бесследно=without a trace
бессмысленно=vacantly
бессмысленность=inanity
бессмысленный=senseless
бессмыслица=nonsense
бессонница=insomnia
бессонный=sleepless
бесстрашие=fearlessness
бесстрашный=fearless
бесстыдно=obscenely
бесстыдный=shameless
бесстыдство=impudence
бестактность=indelicacy
бестактный=tactless
бестолковщина=muddle
бестолковый=stupid
бестолочь=chowderhead
бесцветно=colorless
бесцветность=insipidity
бесчувственность=insensibility
бесчувственный=unfeeling
бетон=concrete
бетонирование=concrete pouring
бетонировать=concrete
бетономешалка=concrete mixer
бешенство=rabies
бешеный=rabid
библейский=biblical
библиограф=bibliographer
библиографический=bibliographic
библиография=bibliography
библиотека=library
библиотекарь=librarian
библия=Bible
бивень=tusk
бигуди=curler
биде=bidet
бидон=can
бижутерия=bijouterie
бизнес=business
бизнесмен=businessman
бизон=buffalo
бикини=bikini
билет=ticket
биллборд=billboard
бинарный=binary
бинт=bandage
бинтование=bandaging
биограф=biographer
биографический=biographical
биография=biography
биолог=biologist
биологический, биологически=biological
биология=biology
биомасса=biomass
биомеханика=biomechanics
бионаука=bioscience
биополе=biological field
биопсия=biopsy
биоритм=biorhythm
биотопливо=biofuel
биохимический=biochemical
биохимия=biochemistry
биоэлектроника=bioelectronics
биоэнергетика=bioenergetics
биржа=exchange
биржевик=speculator
биржевой=referring to exchange
бирка=tag
бирюза=turquoise
бисер=beads
бисерина=bead
бисквит=sponge cake
битва=battle
битый=beaten
бить=beat
битье=beating
бифштекс=steak
благо=good
благоверная=missus
благоверный=pious
благородно=nobly
благородный=noble
благородство=nobility
блаженство=bliss
блаженствовать=luxuriate
блажной=capricious
блажь=whim
бланк=form
блат=pull
блатной=rogue
блевать=barf
блевотина=vomit
бледненький=poor
бледнеть=turn pale
бледно=faintly
блеск=gloss
блестка=paillette
блестяще=brilliantly
блеф=bluff
близкие=folks
близкий=close
бликовать=rejoice
блин=pancake
блок=block
блокада=blockade
блокатор=blocker
блокбастер=blockbuster
блокнот=notebook
блокпост=blockhouse
блоха=flea
блуд=fornication
блудить=fornicate
блудливый=lascivious
блудница=whore
блузка, блуза=blouse
блюдечко=limpet
блюдо=dish
блюдце=saucer
блюз=blues
бобр=beaver
бобрик=frieze
бобровый=beaver
богатей=rich man
богатеть=grow rich
богато=richly
богатство=wealth
богатый=rich
богатырский=heroic
богатырь=hero
богомол=mantis
бодать=bunt
бодрить=invigorate
бодро=freshly
бодрость=cheerfulness
бодрствование=wake
бодрствовать=watch
бодрый=cheerful
боевик=thriller
боец=fighter
бой=fight
бойкий=glib
бойко=trippingly
бойня=massacre
бок=side
бокал=goblet
бокс=boxing
боксер=boxer
боксировать=box
болван=boob
болванка=ingot
болезненно=painfully
болезненность=soreness
болезненный=painful
болезнетворный=pathogenic
болезнь=disease
болельщик=fan
болеро=bolero
болеть=hurt
болотный=swamp
болото=marsh
болтливость=gab
болтливый=chatty
болтовня=chatter
болтун=chatterbox
боль=pain
больница=hospital
больно=painfully
больше=more
большинство=most
большой=large
бомба=bomb
бомбардир=bombardier
бомбардировать=bombard
бомбардировка=bombardment
бомбардировщик=bomber
бордовый=vinous
бордюр=border
бордюрный=curbstone
бормотать=mumble
бормотун=gabbler
бородавка=wart
бородавник=nipplewort
бородавчатый=warty
бородатый=bearded
бородач=bearded man
бородка=barb
борщ=borscht
ботаник=botanist
ботанический=botanic
ботинок=boot
боулинг=bowling
боцман=boatswain
бочка=barrel
бочкообразный=tubby
бочок=flank
боярыня=noblewoman
боярышник=hawthorn
боярышня=boyar
бояться=fear
браво=bravo
бравый=brave
бражник=roisterer
брак=marriage
браковать=cull
браковка=rejection
браковщик=passer
браконьер=poacher
браконьерство=poaching
браслет=bracelet
брат=brother
братва=lads
братец=brer
братство=brotherhood
бревно=log
брег=running
бред=rave
брезгливость=disgust
брезгливый=squeamish
брезговать=be squeamish
брезент=tarpaulin
брезентовый=canvas
брелок=trinket
бретелька=shoulder-strap
брехня=lies
бригада=brigade
бригадир=brigadier
бриз=breeze
бриллиант=diamond
бритва=razor
бритвенный=shaving set
брить=shave
бритье=shaving
бровь=eyebrow
бродить=wander
бродяга=tramp
бродячий=wandering
бройлер=broiler
брокер=broker
брокколи=broccoli
бронебашня=cupola
броневик=armored car
бронежилет=bulletproof vest
бронемашина=armored car
броненосец=ironclad
броненосный=armored
бронза=bronze
бронирование=reservation
бронированный=armored
бронировать=armor
бронхит=bronchitis
бросать=throw
брошь=brooch
брошюра=brochure
брусника=cowberry
брутальный=brutal
брызгать=splash
брызги=spray
брыкание=buck
брынза=feta cheese
брюки=trousers
брюнет=brunet
брюхатый=paunchy
брюхо=belly
бубен=tambourine
бугор=hillock
будда=Buddha
буддизм=Buddhism
будильник=alarm 
будить=wake
будка=booth
будни=weekdays
будний=ferial
будоражить=disturb
будущее=future
буй=buoy
буйвол=buffalo
буйно=violently
букашка=insect
буква=letter
буквально=literally
буквальность=literality
буквальный=literal
букварь=primer
букет=bouquet
буклет=booklet
буксир=tow
буксирный=towing
буксирование=haulage
буксование=skidding
буксовать=skid
буксовка=slip
булава=mace
булавка=pin
булочка=bun
булочная=bakery
булочник=baker
булыжник=cobblestone
булыжник=cobblestone
бульдозер=bulldozer
бульканье=gurgling
булькать=gurgle
бульон=bouillon
бультерьер=bull terrier
бум=boom
бумага=paper
бумажник=wallet
бумеранг=boomerang
бункер=hopper
бунт=revolt
бунтарский=rebellious
бунтарь=rebel
бурбон=bourbon
бурно=roughly
бурность=turbulence
бурундук=chipmunk
бурчание=muttering
бурчать=mutter
бурый=brown
бурьян=tall weeds
буря=storm
бусинка=bead
бутик=boutique
бутылка=bottle
буфет=buffet
буфетная=pantry
буфетный=buffer
буфетчик=barman
буханка=loaf
бухгалтер=accountant
бухгалтерия=bookkeeping
бухта=bay
бушевать=rage
бывший=former
бык=bull
былой=erstwhile
быль=true story
быстро=fast
быт=everyday
бытие=existence
бытовой=domestic
быть=be
бюджет=budget
бюджетник=state employee
бюджетный=budgetary
бюллетень=bulletin
бюргер=burgher
бюро=bureau
бюрократ=bureaucrat
бюрократизация=bureaucracy
бюст=bust
бюстгальтер=bra

вовеки=forever
вовлечение=involvement
вовлечь=drag in
вовлечься=get involved
вовне=outside
вовремя=in time
вовсе=any
водитель=driver
водительство=guidance
водить=conduct
водка=vodka
водоканал=water canal
водопад=waterfall
водопой=watering place
водород=hydrogen
водоросль=alga
военачальник=warlord
военврач=surgeon
военкомат=recruitment office
военнообязанный=reservist
военнопленный=prisoner of war
военнослужащий=serviceman
военный=military
вожак=leader
возбуждать=excite
возбуждаться=get excited
возбуждение=excitation
возбужденно=heatedly
возврат=return
возвратимый=revertible
возвратиться=come again
возвышение=elevation
возгорание=ignition
возможно=perhaps
возможность=opportunity
возможный=possible
возникновение=emergence
возникнуть=come into being
возраст=age
возрастание=increase
война=war
войско=army
вокалист=vocalist
вокалистка=cantatrice
вокальный=vocal
вокзал=railway station
волк=wolf
волнение=excitement
волнорез=breakwater
волокно=fiber
волшебство=magic
вольер=aviary
вольность=liberty
вольный=free
вольт=volt
вольтметр=voltmeter
вольфрам=tungsten
волюта=volute
воля=will
вонь=stink
вонючий=smelly
вонючка=skunk
вообще=at all
воодушевить=inspire
воодушевление=inspiration
воодушевлять=cheer
вор=thief
воровство=theft
воронка=funnel
ворчать=grumble
восемь=eight
восемьдесят=eighty
восемьсот=eighteen hundred
воск=wax
воскликнуть=exclaim
восклицание=exclamation
воспаление=inflammation
воспалительный=inflammatory
воспалить=inflame
воспевать=chant
воспитанность=breeding
воспитанный=fostered
воспитатель=educator
восстание=uprising
восток=east
восторг=delight
восторгать=ravish
восхититься=admire
восхищать=delight
восхищаться=admire
восхищение=admiration
восход=rise
восьмиугольник=octagon
воспоминание=memory
воспринимать=perceive
восприятие=perception
воспроизведение=reproduction
восстать=turn against
впадина=cavity
впервые=first
впереди=ahead
впечатление=impression
впечатленный=impressed
впечатлить=impress
впитывание=absorption
впитывать=soak
враг=enemy
вражда=enmity
враждебно=with hostility
враждебность=hostility
враждебный=hostile
враждовать=feud
вранье=lies
вратарь=goalkeeper
врать=fib
врач=doctor
врачебный=medical
вращать=rotate
вредитель=pest
вредительство=wrecking
вредить=harm
вредность=insalubrity
временно=temporarily
временной=temporal
вроде=like
врожденный=congenital
врозь=apart
врун=liar
вручение=delivery
вручную=manually
всегда=always
вселенная=universe
вселенский=ecumenical
всемогущество=omnipotence
всемогущий=omnipotent
всерьез=seriously
всеядный=omnivorous
вскакивать=jump up
вслух=aloud
вслушиваться=listen attentively
всматриваться=peer
всмятку=soft-boiled
вставать=get up
вставка=insert
вставление=insertion
встреча=meeting
встречать=meet
вступать=enter
вступаться=intercede
вступительный=opening
всякий=any
втирание=chafing
втирать=rub in
втолкнуть=push in
втроем=all three
втройне=threefold
втягивать=retract
вуалировать=veil
вуаль=veil
вулкан=volcano
вулканизатор=vulcanizer
вулканизация=vulcanization
вулканический=volcanic
вход=entry
входить=enter
входной=input
вхождение=occurrence
вцепляться=hold on
вчера=yesterday
вшивать=sew in
выбор=choice
выбрасывать=throw out
вязание=knitting
вязать=knit
вязкий=viscous
вязкость=viscosity
вяло=sluggishly
вялость=lethargy
важно=importantly
важность=importance
важный=important
вакуум=vacuum
вакцина=vaccine
вакцинальный=vaccinal
вакцинация=vaccination
валик=roll
вальс=waltz
валюта=currency
валютный=monetary
вампир=vampire
ванная=bathroom
варвар=barbarian
вареный=boiled
вариант=option
василек=cornflower
ватман=whatman
вафля=wafer
ввод=input
вдали=beyond
вдова=widow
вдоль=along
вдохновить=inspire
вдруг=suddenly
вдуть=blow in
вегетарианец=vegetarian
ведомость=statement
ведро=bucket
ведьма=witch
веер=fan
вежливо=politely
вежливость=courtesy
вежливый=polite
везде=everywhere
век=century
вектор=vector
великий=great
великолепно=sumptuously
величие=greatness
велосипед=bicycle
веник=broom
вентиль=valve
верёвка=rope
верность=fidelity
вернуть=retrieve
верный=faithful
вероятно=likely
версия=version
вертикально=upright
вертолет=helicopter
верх=top
вес=weight
веселый=cheerful
весна=spring
веснушка=freckle
весть=news
ветер=wind
ветеринар=veterinarian
ветеринария=veterinary science
ветряк=windmill
ветрянка=chickenpox
вечер=evening
вечереть=grow dark
вечеринка=party
вещь=thing
вживить=implant
вживление=implantation
взаимно=mutually
взаимность=reciprocity
взаимный=mutual
взамен=instead
взболтать=shake up
взвод=platoon
взгляд=sight
взлом=breaking open
вибрация=vibration
видение=vision
виза=visa
визит=visit
вилка=fork
вина=fault
вино=wine
виноград=grape
виолончель=cello
вирус=virus
вирусный=viral
виски=whiskey
вишня=cherry
вклад=contribution
вкус=taste
влага=moisture
владелец=owner
владеть=own
власть=power
вливание=infusion
влюбиться=fall in love
вместе=together
вместо=instead
вмятина=dent

Гавайи=Hawaii
гавань=harbor
гад=skunk
гаджет=gadget
гадость=filth
гадюка=viper
газ=gas
газель=gazelle
газета=newspaper
газировка=aeration
гаишник=traffic cop
гайка=nut
гайморит=maxillary sinusitis
галантерея=haberdashery
галерея=gallery
галочка=tick
гамак=hammock
гамаша=gaiter
гамбургер=hamburger
гамма=gamma
гангстер=gangster
гандбол=handball
гантель=dumbbell
гараж=garage
гардероб=wardrobe
гармония=harmony
гарнир=garnish
гарпун=harpoon
гвардеец=guardsman
где=where
геккон=gecko
гелий=helium
гематома=hematoma
ген=gene
гениальный=genial
гений=genius
география=geography
геометрия=geometry
гепард=cheetah
гиацинт=hyacinth
гибнуть=perish
гибрид=hybrid
гигант=giant
гигиена=hygiene
гид=guide
гидрант=hydrant
гиена=hyena
гимн=hymn
гитара=guitar
гитарист=guitarist
глава=chapter
главарь=ringleader
главный=main
глагол=verb
гладкий=smooth
глаз=eye
глазурь=glaze
глина=clay
глобус=globe
глотнуть=take a sip
глубина=depth
глупо=absurdly
глюкоза=glucose
глютен=gluten
гнев=anger
гневаться=be angry
гнездо=nest
гнилой=rotten
гном=gnome
гнуть=bend
говорить=say
говядина=beef
годный=suitable
годовщина=anniversary
гол=goal
голод=hunger
голодание=starvation
голодать=starve
голодающий=starving
голодный=hungry
голосование=voting
голосовать=vote
голубь=dove
гольф=golf
гонка=race
горб=hump
гордо=proudly
горевать=grieve
гореть=burn
горизонтальный=horizontal
горилла=gorilla
горло=throat
гормон=hormone
гороскоп=horoscope
горох=peas
горький=bitter
гостиница=hotel
грабить=rob
грабли=rake
градус=degree
градусник=thermometer
грамотность=literacy
грамотный=literate
грамотность=literacy
грамотный=literate
грейпфрут=grapefruit
грива=mane
грипп=influenza
гроб=coffin
грот=grotto
грубый=rude
груз=goods
грузовик=truck
грустно=sadly
грустный=sad
грусть=sorrow
груша=pear
грязно=dirtily
грязь=mud
губа=lip
гудок=beep
гул=hum
гурман=gourmet
гусеница=caterpillar
густой=thick
гусь, гусыня=goose
давать=give
давить=press
даже=even
дайвинг=diving
даль=distance
данные=data
дантист=dentist
дань=tribute
дата=date
два=two
двадцатый=twentieth
двадцать=twenty
дважды=twice
двенадцатый=twelfth
двенадцать=twelve
дверь=door
двигатель=engine
движение=movement
двор=yard
дебаты=debate
дебют=debut
дебютант=debutant
девиз=motto
девочка=girl
девятый=ninth
девять=nine
девятьсот=nineteen hundred
дедушка=grandfather
дежурить=keep vigil
декан=dean
деканат=deanery
декор=decoration
дельфин=dolphin
дельфинарий=dolphinarium
демон=demon
депо=depot
депозит=deposit
деревня=village
дерево=tree
десерт=dessert
десятый=tenth
десять=ten
дефект=defect
дешево=cheap
джаз=jazz
джакузи=jacuzzi
джемпер=jumper
джентльмен=gentleman
джунгли=jungle
дзюдо=judo
диабет=diabetes
диабетик=diabetic
диагноз=diagnosis
диалог=dialogue
диаметр=diameter
диван=sofa
диета=diet
директор=director
дискотека=disco
дисплей=display
дистанция=distance
длина=length
для=for
дневник=diary
доверие=trust
догадка=guess
договор=contract
дождь=rain
доза=dose
документ=document
дом=house
дорога=road
дорого=expensive
доступ=access
дракон=dragon
древний=ancient
дрессировать=tame
дрессировка=training
друг=friend
другой=other
дружба=friendship
дуб=oak
дубитель=hardener
дубить=tan
дух=spirit
дуэт=duet
дым=smoke
дыня=melon
дюйм=inch
дядя=uncle
дятел=woodpecker
его=his
еда=food

жаба=toad
жадина=meanie
жадничать=be greedy
жадно=greedily
жадность=greed
жажда=thirst
жаждать=crave
жалеть=spare
жалоба=complaint
жалость=pity
жалюзи=louvers
жанр=genre
жарить=fry
жариться=roast
жвачка=cud
жгут=tourniquet
ждать=wait
жевательный=chewing
жевать=chew
желаемый=wishful
желание=desire
железный=iron
желток=yolk
желтый=yellow
желудок=stomach
желудь=acorn
жемчуг=pearl
жена=wife
женатый=married
женский=female
жерло=mouth
жестокий=cruel
живо=quick
животное=animal
жизнь=life
жир=fat
жокей=jockey
жребий=lot
жук=beetle
журавль=crane
журнал=magazine
журналист=journalist
жуть=dismay

забава=fun
забавно=amusingly
забавный=funny
заболеть=fall ill
забота=care
завал=goaf
заварка=welding
заведение=institution
завершать=complete
завет=covenant
заветный=cherished
завешать=hang
завидно=enviably
завидный=enviable
завидовать=envy
завод=factory
завязать=tie
загадочно=darkly
загадочность=inscrutability
загадочный=enigmatic
загар=tan
заговор=conspiracy
загон=paddock
загрузка=download
загс=registry office
звание=rank
звезда=star
звездопад=meteoric shower
зверь=beast
звонить=ring
звонок=bell
звук=sound
звукозапись=recording
здание=building
здесь=here
здорово=awesome
здоровый=healthy
зебра=zebra
зебу=zebu
земля=earth
зенит=zenith
зеркало=mirror
зеркальный=specular
зима=winter
злить=anger
злиться=rage
зло=evil
злоба=malice
злобно=malevolently
знать=know
золото=gold
золушка=Cinderella
зонт=umbrella
зоограф=zoographer
зоография=zoography
зоопарк=zoo
зрачок=pupil
зрелище=spectacle
зубр=aurochs

игла=needle
игра=game
играть=play
игривый=playful
игрушка=toy
идеал=ideal
идеализация=idealization
идея=idea
идиот=idiot
идол=idol
идти=go
иерархия=hierarchy
иероглиф=hieroglyph
избабиться=effeminate
икона=icon
икота=hiccup
икра=roe
или=or
иллюстратор=illustrator
иллюстрация=illustration
имбирь=ginger
именно=exactly
имитатор=simulator
имитация=imitation
импульс=pulse
имя=name
иначе=otherwise
ипподром=hippodrome
искажать=distort
искажение=distortion
искаженный=distorted
искатель=finder
искать=search
исключать=exclude
исключение=exclusion
исключительно=exclusively
искра=spark
искусственно=artificially
испуг=fright
источать=stream
источник=source
исчезать=disappear
исчезновение=disappearance
итак=so
их=their
йогурт=yoghurt
йод=iodine

кабак=pub
кабан=boar
кабачок=squash
кабель=cable
кабина=cabin
каблук=heel
кабриолет=cabriolet
кагор=Cahors wine
казарма=barracks
казино=casino
казна=coffers
какаду=cockatoo
каковой=which
кактус=cactus
калорийность=calorific value
калькулятор=calculator
кальмар=squid
кальян=hookah
камбала=flounder
камера=camera
Камерун=Cameroon
Камчатка=Kamchatka
камыш=cane
Канада=Canada
канадец=Canadian
канарейка=canary
канат=rope
кандалы=shackles
каникулы=vacation
канистра=jerrycan
канифоль=rosin
капелька=droplet
капитал=capital
капитализм=capitalism
капиталист=capitalist
капитан=captain
капкан=trap
капот=hood
капрал=corporal
каприз=caprice
капризничать=be capricious
капсула=capsule
капуста=cabbage
капучино=cappuccino
капюшон=hood
карабин=carbine
каравай=loaf
караван=caravan
карантин=quarantine
карапуз=tot
карась=crucian
карат=carat
кардиолог=heart specialist
кардиология=cardiology
карета=coach
каркас=frame
карлик=dwarf
карма=karma
карман=pocket
карп=carp
картавый=burry
картинка=picture
картошка=spud
картридж=cartridge
карусель=roundabout
Карфаген=Carthage
кассета=cassette
кассир=cashier
кастрюля=pan
катакомба=catacomb
катамаран=catamaran
катание=driving
катапульта=catapult
катапультирование=ejection
катать=ride
категория=category
катер=cutter
катиться=roll
Катманду=Katmandu
катушка=bobbin
катышек=pellet
кафедра=chair
кафедральный=cathedral
кафель=tile
каша=porridge
кашалот=sperm whale
каяк=kayak
каяться=repent
квадрат, квадратный=square
квалификация=qualification
квалифицированно=ably
квантификация=quantification
квантование=quantification
квантовать=quantize
квартал=quarter
квартальный=quarterly
квартира=apartment
кварц=quartz
кебаб=kebab
кедр=cedar
кемпинг=camping
кенгуру=kangaroo
кентавр=centaur
кетчуп=ketchup
кефаль=mullet
кефир=kefir
кибернетик=cybernetist
киборг=cyborg
киви=kiwi
кивнуть, кивок=nod
кидать=throw
кидаться=fling
килограмм=kilo
километр=kilometer
километраж=mileage
кино=movie
кинозал=cinema hall
кипарис=cypress
кипение=boiling
кипеть=boil
кирпич=brick
кислород=oxygen
кислота=acid
кислотность=acidity
кит=whale
клавиатура=keyboard
клад=buried treasure
кладбище=cemetery
кладка=placing
кладовая=pantry
кладовщик=storekeeper
кладовщица=storekeeper
кладоискатель=treasure hunter
кладчик=layer
кладь=load
клаксон=klaxon
клан=clan
клановый=clannish
кланяться=bow
клапан=valve
клапанный=valve
кларет=claret
классификация=classification
классифицировать=classify
классический=classical
класть=put
клинометр=clinometer
клоун=clown
книга=book
ковер=carpet
кодекс=code
кодирование=coding
кодировать=encode
кодировка=encoding
кодировщик=coder
коза=goat
козерог=ibex
коллега=colleague
колючий=barbed
компилятор=compiler
кондуктор= jig
консоль=console
контраст=contrast
корица=cinnamon
коричневый=brown
корм=feed
кошка=cat
креветка=shrimp
кредит=credit
крепость=fortress
кресло, стул=chair
кто=who
кукуруза=corn
кукушка=cuckoo
кулак=fist
купальник=swimming suit
купить=buy
кроссовок=sneakers
крот=mole
кстати=by the way

лабиринт — maze
лаборатория — laboratory
лава — lava, longwall
лаванда — lavender
лагерь — camp
лазер — laser
лазить — climb
лампа — lamp
ланч — lunch
лань — doe
лебедь — swan 
лев — lion
левша — left-hander
левый — left
легальность — legality
легальный — legal
легенда — legend
легендарность — fabulosity
легендарный — legendary
легкий — easy
лед — ice
леденец — lollipop
леди — lady
ледник — glacier
лектор — lecturer
ленивый — lazy
леопард — leopard
