абрикос=apricot
абонент=subscriber
абитуриент=enrollee
абзац=paragraph
абсолютно=absolutely
абажур=shade
ажитация=agitation
ажур=openwork
азарт=excitement
азартно=recklessly
азбука=alphabet
азот=nitrogen
азотистый=nitrous
аист=stork
айсберг=iceberg
академик=academician
академический=academic
академия=academy
акация=acacia
акваланг=aqualung
аквалангист=aqualunger
аквамарин=aquamarine
аквамариновый=aquamarine
аквапарк=aquapark
акваплан=aquaplane
акварель=watercolor
акварельный=watercolor
аквариум=aquarium
акватория=waterarea
акведук=aqueduct
аккорд=accord
аккордеон=accordion
аккордеонист=accordionist
аккумулятор, батарея=battery
аккуратно=carefully
аккуратность=accuracy
аккуратный=careful
акрил=acrylic
акриловый=acrylic
акробат=acrobat
акробатика=acrobatics
акробатический=acrobatic
аксессуар=accessory
акт=act
актер=actor
актерский=actorish
актерство=acting
актив=assets
активатор=activator
активация=activation
активировать=activate
активист=activist
активно=energetically
активность=activity
актриса=actress
актуально=topically
актуальность=topicality
актуальный=actual
акула=shark
акустический=acoustic
акушер=obstetrician
акушерка=midwife
акушерский=obstetric, obstetrical
акушерство=obstetrics
акцент=accent
акцентировать=emphasize
акция=action
алгебра=algebra
алгебраический=algebraic
алгоритм=algorithm
алгоритмический=algorithmic
алебастр=alabaster
алебастровый=alabastrine
алкаш=boozer
алкоголизм=alcoholism
алкоголик=alcoholic
алкоголичка=alcoholic
алкоголь=alcohol
аллегорический=allegorical
аллегория=allegory
аллея=alley
аллилуйя=hallelujah
аллитерация=alliteration
алло=hulloa
алмаз=diamond
алмазный=diamond
алоэ=aloe
алтарь=altar
алфавит=alphabet
алфавитный=alphabetical
алхимик=alchemist
алхимический=alchemical
алхимия=alchemy
алчно=avidly
алчность=greed
алчный=greedy
алый=scarlet
алыча=alycha
альбом=album
альпинизм=mountaineering
альпинист=climber
альтернатива=alternative
альтернативный=alternative
альфонс=gigolo
алюминиевый=aluminum
алюминий=aluminum
амазонка=Amazon
амазонский=Amazonian
амбар=barn
амбициозность=ambition
амбиция=ambition
амеба=amoeba
аметист=amethyst
аминь=amen
амнезия=amnesia
аморфизм=amorphism
аморфный=amorphous
амплитуда=amplitude
амулет=amulet
амфибия=amphibian
амфора=amphora
анаконда=anaconda
аналептический=analeptic
анализ=analysis
анализатор=analyzer
анализирование=assaying
анализировать=analyze
аналитик=analyst
аналитический=analytical
аналог=analogue
аналогический=analogical
аналогичный=analogous
аналогия=analogy
ананас=pineapple
анархичный=anarchist
анархия=anarchy
анатомический=anatomical
анатомия=anatomy
ангар=hangar
ангел=angel
ангина=angina
английский=English
англичанин=Englishman
англичанка=Englishwoman
анекдот=joke
анестезиолог=anesthetist
анестезировать=anesthetize
анестезист=anesthetist
анестезия=anesthesia
анимационный=animated
анимация=animation
анкета=questionnaire
анкетирование=questionnaire
аннотация=annotation
ансамбль=ensemble
антивирус=virus
антидепрессант=antidepressant
античность=antiquity
античный=antique
антоним=antonym
антонимичный=antonymous
антракт=intermission
антураж=entourage
анчоус=anchovy
аншлаг=full house
апартамент=apartment
апатично=torpidly
апатичность=lethargy
апатичный=apathetic
апатия=apathy
апельсин=orange
аплодировать=applaud
аплодисменты=applause
апология=apology
апостроф=apostrophe
аппарат=machine
аппетит=appetite, stomach
аппетитный=appetizing
апрель=April
аптека=pharmacy
аптекарь=apothecary
аптечка=medicine chest
арбалет=crossbow
арбуз=watermelon
аргумент=argument
аргументация=argumentation
аренда=lease
арендатор=tenant
арендный=rent
арендовать=lease
арест=arrest
арестант=prisoner
арестованный=arrested
аристократ=aristocrat
аристократизм=aristocracy
аристократический=aristocratic
аритмичный=unrhythmical
аритмия=arrhythmia
арифметик=arithmetician
арифметический=arithmetic
арматура=fittings
армия=army
аромат=flavor
арсенал=arsenal
артист=artist
артистический=artistic
артистичность=artistry
арфа=harp
арфист=harper
археолог=archaeologist
археологический=archaeological
археология=archaeology
архив=archives
асимметричный=asymmetric
асимметрия=asymmetry
асимптота=asymptote
асинхронный=asynchronous
аспирант=graduate student
аспирин=aspirin
ассимиляционный=anabolic
ассимиляция=assimilation
ассистент=assistant
ассортимент=assortment
астероид=asteroid
астронавт=astronaut
астронавтика=astronautics
астрономический=astronomical
астрономия=astronomy
асфальт=asphalt